// +----------------------------------------------------------------------
// | User: DaMing
// +----------------------------------------------------------------------
// | Email: 3228985941@qq.com
// +----------------------------------------------------------------------
// | Date: 2022
// +----------------------------------------------------------------------


/**
 * 权限中间件
 */
module.exports = {
  /**
   * 验证权限
   * @param {*} req 
   * @param {*} res 
   * @param {*} next 
   */
  auth(req, res, next) {
    let token = req.get('Authorization')
    // console.log('token',token)
    if (!token) {
      res.send({
        code: 400,
        msg: "该用户没有权限"
      })
    } else {
      // 可以给请求对象注入信息，在控制器使用
      req.user = {
        id: 1,
      }
      next();
    }
  }

}