// +----------------------------------------------------------------------
// | User: DaMing
// +----------------------------------------------------------------------
// | Email: 3228985941@qq.com
// +----------------------------------------------------------------------
// | Date: 2022
// +----------------------------------------------------------------------

'use strict';

module.exports = {
  // 邮件调试模式
  debug: false,
  // 发送商
  host: global.Env('email.HOST',''),
  // 发件人邮箱
  username: global.Env('email.USERNAME',''),
  // 发件箱授权码
  password: global.Env('email.PASSWORD',''),
  // 端口
  port: global.Env('email.PORT',''),
}