// +----------------------------------------------------------------------
// | User: DaMing
// +----------------------------------------------------------------------
// | Email: 3228985941@qq.com
// +----------------------------------------------------------------------
// | Date: 2022
// +----------------------------------------------------------------------

'use strict';

var router = require('express').Router();

// 导入控制器
var index = require('../app/index/controller/IndexController');

/**
 * 请求路由
 */
router.get('/', index.index); // 首页路由


module.exports = router;